package Lesson8;
/*
Общие задачки: напишите метод, который принимает в качестве параметра любую строку, например “I like Java!!!”.
Распечатать последний символ строки.
Проверить, заканчивается ли ваша строка подстрокой “!!!”.
Проверить, начинается ли ваша строка подстрокой “I like”.
Проверить, содержит ли ваша строка подстроку “Java”.
Найти позицию подстроки “Java” в строке “I like Java!!!”.
Заменить все символы “а” на “о”.
Преобразуйте строку к верхнему регистру.
Преобразуйте строку к нижнему регистру.
Вырезать подстроку Java
 */
public class Task1 {

}
